<script setup lang="ts">
import StyledText from '@/components/StyledText.vue'
import { setupSkillContentMeta } from '@/utils/contentMeta'

setupSkillContentMeta('aurora', 'zh')
</script>

<template>
  <StyledText>
    <article>
      <h1>奥萝菈</h1>

      <h2>召唤</h2>

      <h3>终极技能</h3>
      <p>
        奥萝菈在身边召唤“星梦独角兽”桑尼并进入沉睡。桑尼继承自身[[140%]]的生命值和[[120%]]的其他[[基础属性]]，还会产生彩虹光环鼓舞友军，使所有友方召唤物提高[[50]]点急速且移动时的碰撞体积变小。本技能可以在受到控制期间释放。沉睡期间奥萝菈处于[[无敌]]状态，进行普通攻击时将具象化梦境中的物品，对敌人造成[[320%]]伤害。在桑尼被击败时，奥萝菈会立刻惊醒，可以被攻击且无法使用终极技能以外的其他技能。
      </p>
      <p>
        被动地，在战斗开始时奥萝菈就会处于沉睡状态并召唤桑尼，布阵最靠前的一名敌方英雄将被指定为“梦魇”，攻击力提升[[2%]]，急速降低[[40]]点，且桑尼会率领所有友方召唤物一同追击梦魔。
      </p>

      <h3>技能</h3>
      <p>
        本技能仅在奥萝菈沉睡期间可以使用。在自己身边召唤一只最多存在[[12]]秒的仙兔，继承自身[[100%]]的生命值和[[80%]]的其他[[基础属性]]。仙兔的普通攻击会对敌人造成[[100%]]的伤害，并且当其达到存在时限时会跳向2格范围内最近的1名敌人并爆炸，对其周围1格的所有敌人造成[[340%]]的伤害。
      </p>
    </article>
  </StyledText>
</template>
