<script setup lang="ts">
import { setupContentMeta } from '@/utils/contentMeta'

setupContentMeta({
  title: '亚莉克希 (弓神) · 技能',
  description:
    '被动地，亚莉克希特“光翼”权能赋予一名友军，使其在对敌人造成3次远程伤害时发射1枚飞羽，对敌人造成120%伤害，每0.5秒至多触发一次。若拥有“光翼”权能的友军为远程角色还会额外提升5格普通攻击的攻击距离。亚莉克希优先选择同排最近的友军赋予权能。且这名友军会在被击败后失去权能。',
  url: 'skill/aliceth',
  locale: 'zh',
  keywords: ['Aliceth', '亚莉克希', '弓神'],
})
</script>

<template>
  <article>
    <h1>亚莉克希 (弓神)</h1>

    <h2>特殊目标机制</h2>

    <h3>技能</h3>
    <p>
      被动地，亚莉克希特“光翼”权能赋予一名友军，使其在对敌人造成3次远程伤害时发射1枚飞羽，对敌人造成120%伤害，每0.5秒至多触发一次。若拥有“光翼”权能的友军为远程角色还会额外提升5格普通攻击的攻击距离。亚莉克希优先选择同排最近的友军赋予权能。且这名友军会在被击败后失去权能。
    </p>
    <p>
      战斗开始时，亚莉克希使用“辉煌圣瞳”锁定场上最远的敌人，使自身和“光翼”权能的友军优先对其进行攻击，并且对这名敌人造成的伤害额外提升35点穿透。
    </p>
  </article>
</template>
