<script setup lang="ts">
import { setupContentMeta } from '@/utils/contentMeta'

setupContentMeta({
  title: '伊莱亚和莱拉 (双子) · 技能',
  description:
    '布阵时，伊莱亚和莱拉之间会形成一道“星界牵绊”。若伊莱亚和莱拉刚好在同一条直线路径上，则还会与布阵在二人中间的所有友方英雄建立“星界牵绊”。',
  url: 'skill/elijah-lailah',
  locale: 'zh',
  keywords: ['Elijah & Lailah', '伊莱亚和莱拉', '双子'],
})
</script>

<template>
  <article>
    <h1>伊莱亚和莱拉 (双子)</h1>

    <h2>充能</h2>

    <h3>技能机制</h3>
    <p>
      布阵时，伊莱亚和莱拉之间会形成一道“星界牵绊”。若伊莱亚和莱拉刚好在同一条直线路径上，则还会与布阵在二人中间的所有友方英雄建立“星界牵绊”。
    </p>
    <p>
      主动使用时，伊莱亚沿“星界牵绊”向莱拉传递一团金色光芒，为途经的每位“星界牵绊”内的友军恢复30点能量
    </p>

    <h3>专武技能</h3>
    <p>
      战斗开始时，若“星界牵绊”内除伊莱亚和莱拉以外的所有友军均来自同一阵营，则会使“星界牵绊”获得“共鸣”效果。在“共鸣”效果影响下，“星界牵绊”额外提升其中友军10点受愈与10%能量获取速度，并且当“星界牵绊”中的每一名友军均释放过终极技能后，“星界牵绊”将会爆发出永久性的能量激荡来鼓舞全体友军，使场上所有友军在每次释放终极技能之后返还10%的能量消耗。
    </p>
  </article>
</template>
