<script setup lang="ts">
import StyledText from '@/components/StyledText.vue'
import { setupSkillContentMeta } from '@/utils/contentMeta'

setupSkillContentMeta('elijah-lailah', 'zh')
</script>

<template>
  <StyledText>
    <article>
      <h1>伊莱亚和莱拉 (双子)</h1>

      <h2>充能</h2>

      <h3>技能</h3>
      <p>
        布阵时，伊莱亚和莱拉之间会形成一道“星界牵绊”。若伊莱亚和莱拉刚好在同一条[[直线路径]]上，则还会与布阵在二人中间的所有友方英雄建立“星界牵绊”。
      </p>
      <p>
        主动使用时，伊莱亚沿“星界牵绊”向莱拉传递一团金色光芒，为途经的每位“星界牵绊”内的友军恢复[[30]]点能量
      </p>

      <h3>专武技能</h3>
      <p>
        战斗开始时，若“星界牵绊”内除伊莱亚和莱拉以外的所有友军均来自同一阵营，则会使“星界牵绊”获得“共鸣”效果。在“共鸣”效果影响下，“星界牵绊”额外提升其中友军[[10]]点受愈与[[10%]]能量获取速度，并且当“星界牵绊”中的每一名友军均释放过终极技能后，“星界牵绊”将会爆发出永久性的能量激荡来鼓舞全体友军，使场上所有友军在每次释放终极技能之后返还[[10%]]的能量消耗。
      </p>

      <h2>非永久增益</h2>

      <h3>终极技能</h3>
      <p>
        主动使用时，二人会一同起舞，为全体友军提升[[60]]点急速，持续[[7]]秒。本技能持续时间内，二人还会使“星界牵绊”内的所有友军获得[[霸体]]。本技能仅当伊莱亚处于可以使用终极技能的状态下时才能使用。
      </p>
    </article>
  </StyledText>
</template>
