<script setup lang="ts">
import { setupContentMeta } from '@/utils/contentMeta'

setupContentMeta({
  title: '赞东 (人马) · 技能',
  description:
    '战斗开始时，召唤5格宽度的自身虚影朝敌方阵营方向冲锋，破坏沿途的阻挡，对敌人造成10%伤害，并鼓舞沿途的所有友军。赞东和被鼓舞的其他友军分别永久提升50%和20%最大生命值（当前生命值保持不变），并在后续的8秒内提升40点生命汲取，20点急速与100%移动速度。',
  url: 'skill/zandrok',
  locale: 'zh',
  keywords: ['Zandrok', '赞东', '人马'],
})
</script>

<template>
  <article>
    <h1>赞东 (人马)</h1>

    <h2>非永久增益</h2>

    <h3>技能</h3>
    <p>
      战斗开始时，召唤5格宽度的自身虚影朝敌方阵营方向冲锋，破坏沿途的阻挡，对敌人造成10%伤害，并鼓舞沿途的所有友军。赞东和被鼓舞的其他友军分别永久提升50%和20%最大生命值（当前生命值保持不变），并在后续的8秒内提升40点生命汲取，20点急速与100%移动速度。
    </p>
    <p>主动使用时，鼓舞周围2格范围内的友军，使其获得25点生命汲取和14点急速，持续8秒，不可叠加。</p>
  </article>
</template>
